In [78]:
import numpy as np
import pandas as pd

In [79]:
titles = pd.read_csv('titles - titles.csv')

In [80]:
titles

                          title  year
0                The Rising Son  1990
1             Ashes of Kukulcan  2016
2       The Thousand Plane Raid  1969
3              Crucea de piatra  1993
4                        The 86  2015
...                         ...   ...
215976           Le mouton noir  1922
215977      Edge of the Unknown  2015
215978                    E yue  2005
215979             Lakota Girls  2015
215980             The Sting II  1983

[215981 rows x 2 columns]

In [81]:
titles.title.describe()

count     215981
unique    197575
top       Hamlet
freq          19
Name: title, dtype: object

#### 제작년도 내림차순 정렬

In [82]:
titles_asc = titles.sort_values(by = 'year', ascending = True)

In [83]:
titles_asc.head(2)

                                                    title  year
165182                                         Miss Jerry  1894
85708   Reproduction of the Corbett and Fitzsimmons Fight  1897

#### 전체 영화 개수?

In [93]:
titles.shape

(215981, 2)

In [94]:
len(titles)

215981

#### 제목에 Hamlet 이 포함되는 영화들

In [84]:
title_Hamlet = titles.loc[titles['title'].str.contains('Hamlet')]

In [85]:
title_Hamlet.describe()

              year
count    54.000000
mean   1988.148148
std      32.185434
min    1910.000000
25%    1974.500000
50%    2002.500000
75%    2012.000000
max    2016.000000

#### 제목이 Hamlet인 영화들의 개수

In [86]:
titles[titles['title'] == 'Hamlet'].count()

title    19
year     19
dtype: int64

In [87]:
title_Treasure = titles[titles['title'] == 'Treasure Island']

In [88]:
title_Treasure.count()

title    8
year     8
dtype: int64

In [95]:
title_Treasure.sort_values('year', ascending=False)

                  title  year
166675  Treasure Island  1999
190792  Treasure Island  1985
103646  Treasure Island  1973
104714  Treasure Island  1972
90175   Treasure Island  1950
192917  Treasure Island  1934
47769   Treasure Island  1920
191379  Treasure Island  1918

#### 제작년도가 1950에서 1959 사이인 영화

In [90]:
titles_50 = titles[(titles['year'] >= 1950) & (titles['year'] <= 1959)]

In [91]:
titles_50.title.describe()

count       12120
unique      12063
top       Passion
freq            2
Name: title, dtype: object

In [92]:
titles['year']

0         1990
1         2016
2         1969
3         1993
4         2015
          ...
215976    1922
215977    2015
215978    2005
215979    2015
215980    1983
Name: year, Length: 215981, dtype: int64